Table of Contents
 Enum CutOrientation
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Represents the type of the cut
public enum CutOrientation
Fields
Default = 0
The cut is in default (parallel) with cutting plane
Parallel = 1
The cut is in parallel with cutting plane
Perpendicular = 2
The cut is perpendicular to cutting plane
Fields
 Name |  Description
 Default = 0
The cut is in default (parallel) with cutting plane
 Parallel = 1
The cut is in parallel with cutting plane
 Perpendicular = 2
The cut is perpendicular to cutting plane
 Edit this page